In [1]:
import pandas as pd

In [2]:
pd.read_csv(filepath_or_buffer='pokemon.csv')

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [6]:
pd.read_csv(filepath_or_buffer='pokemon.csv',
            index_col='Pokemon')

                       Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]

In [7]:
pokemon = pd.read_csv(filepath_or_buffer='pokemon.csv',
                      index_col='Pokemon')

In [8]:
pd.read_csv('google_stocks.csv').head()

         Date  Close
0  2004-08-19  49.98
1  2004-08-20  53.95
2  2004-08-23  54.50
3  2004-08-24  52.24
4  2004-08-25  52.80

In [13]:
pd.read_csv(filepath_or_buffer='google_stocks.csv',
            parse_dates=['Date'])

           Date    Close
0    2004-08-19    49.98
1    2004-08-20    53.95
2    2004-08-23    54.50
3    2004-08-24    52.24
4    2004-08-25    52.80
...         ...      ...
3819 2019-10-21  1246.15
3820 2019-10-22  1242.80
3821 2019-10-23  1259.13
3822 2019-10-24  1260.99
3823 2019-10-25  1265.13

[3824 rows x 2 columns]

In [14]:
google = pd.read_csv(filepath_or_buffer='google_stocks.csv',
                     index_col='Date',
                     parse_dates=['Date'])
google.head()

            Close
Date
2004-08-19  49.98
2004-08-20  53.95
2004-08-23  54.50
2004-08-24  52.24
2004-08-25  52.80

In [15]:
pd.read_csv('revolutionary_war.csv')

                                Battle  Start Date          State
0                         Powder Alarm    9/1/1774  Massachusetts
1    Storming of Fort William and Mary  12/14/1774  New Hampshire
2     Battles of Lexington and Concord   4/19/1775  Massachusetts
3                      Siege of Boston   4/19/1775  Massachusetts
4                   Gunpowder Incident   4/20/1775       Virginia
..                                 ...         ...            ...
227                Siege of Fort Henry   9/11/1782       Virginia
228         Grand Assault on Gibraltar   9/13/1782            NaN
229          Action of 18 October 1782  10/18/1782            NaN
230          Action of 6 December 1782   12/6/1782            NaN
231          Action of 22 January 1783   1/22/1783       Virginia

[232 rows x 3 columns]

In [16]:
pd.read_csv(filepath_or_buffer='revolutionary_war.csv',
            index_col='Start Date',
            parse_dates=['Start Date'])

                                       Battle          State
Start Date
1774-09-01                       Powder Alarm  Massachusetts
1774-12-14  Storming of Fort William and Mary  New Hampshire
1775-04-19   Battles of Lexington and Concord  Massachusetts
1775-04-19                    Siege of Boston  Massachusetts
1775-04-20                 Gunpowder Incident       Virginia
...                                       ...            ...
1782-09-11                Siege of Fort Henry       Virginia
1782-09-13         Grand Assault on Gibraltar            NaN
1782-10-18          Action of 18 October 1782            NaN
1782-12-06          Action of 6 December 1782            NaN
1783-01-22          Action of 22 January 1783       Virginia

[232 rows x 2 columns]

In [19]:
battles = pd.read_csv(filepath_or_buffer='revolutionary_war.csv',
                      index_col='Start Date',
                      parse_dates=['Start Date'],
                      usecols=['State', 'Start Date'])
battles.head()

                    State
Start Date
1774-09-01  Massachusetts
1774-12-14  New Hampshire
1775-04-19  Massachusetts
1775-04-19  Massachusetts
1775-04-20       Virginia

In [21]:
google.sort_values(by='Close', ascending=True)

              Close
Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
...             ...
2019-04-23  1264.55
2019-10-25  1265.13
2018-07-26  1268.33
2019-04-26  1272.18
2019-04-29  1287.58

[3824 rows x 1 columns]

In [23]:
pokemon.sort_values('Type')

                     Type
Pokemon
Illumise              Bug
Silcoon               Bug
Pinsir                Bug
Burmy                 Bug
Wurmple               Bug
...                   ...
Tirtouga     Water / Rock
Relicanth    Water / Rock
Corsola      Water / Rock
Carracosta   Water / Rock
Empoleon    Water / Steel

[809 rows x 1 columns]

In [25]:
pd.Series(data=['Adam', 'adam', 'Ben']).sort_values()

0    Adam
2     Ben
1    adam
dtype: object